tdamsma/esp32c6-zigbee-probe/probe/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c6"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ZB_ENABLED=y
CONFIG_ZB_ZCZR=y
CONFIG_FREERTOS_HZ=1000

# Full RF calibration at every boot. With the default partial calibration
# this board's Wi-Fi receiver found zero access points while BLE and
# 802.15.4 worked, and full calibration fixed it. Costs ~100 ms of boot.
CONFIG_ESP_PHY_RF_CAL_FULL=y

# ZLL master key (index 4). Set so install_master_key() advertises the master
# key alone, making the selected Touchlink key unambiguous.
CONFIG_PROBE_TOUCHLINK_MASTER_KEY="9F55************************EE31"

# Router role. A coordinator cannot be adopted as a Touchlink target: the
# remote creates its own network and adds the target to it. Without this a
# fresh clone reproduces the failure described in TOUCHLINK-INVESTIGATION.md.
CONFIG_PROBE_ROLE_ROUTER=y
